In [2]:
import pandas as pd 

# dataset_1
dataset_1 = pd.DataFrame({
    "Name"  : ['yash','tanya','tushi','mohit'],
    "age"   : [21,20,18,25],   # keep numbers, not strings
    "salary":[100000,10000,20000,150],
    "work"  : ['data science','sales executive','accounted','swiper']
})

# dataset_2
dataset_2 = pd.DataFrame({
    "Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
    "age"   : [21,23,20,18,25,26,45,22,30],
    "salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
    "work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
               'maneger','bank maneger','scientest']   
})

# merging the two data set 
df = pd.merge(dataset_1, dataset_2, on='age', how="inner")
# inner functuion sowing only common data in the both data set 

print("Inner Join function in the merging :-")
print(df)

Inner Join function in the merging :-
  Name_x  age  salary_x           work_x Name_y  salary_y           work_y
0   yash   21    100000     data science   yash    101000     data science
1  tanya   20     10000  sales executive  tanya     10000  sales executive
2  tushi   18     20000        accounted  tushi     20000        accounted
3  mohit   25       150           swiper  mohit       150           swiper

# they showing m*n = data 
* cross joint
* where m is ds1 or n is ds2

In [ ]:
dataset_1 = pd.DataFrame({
    "Name"  : ['yash','tanya','tushi','mohit'],
    "age"   : [21,20,18,25],   # keep numbers, not strings
    "salary":[100000,10000,20000,150],
    "work"  : ['data science','sales executive','accounted','swiper']
})

# dataset_2
dataset_2 = pd.DataFrame({
    "Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
    "age"   : [21,23,20,18,25,26,45,22,30],
    "salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
    "work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
               'maneger','bank maneger','scientest']   
})
df = pd.merge(dataset_1,dataset_2, how = "cross")
print(df)

In [9]:
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]})
ds2 = pd.DataFrame({'c':[1,2,3,4],'d':[6,5,49,8]})
ds1.join(ds2)

   c   d          Name  age  salary             work
0  1   6          yash   21  101000     data science
1  2   5  yash vardhan   23  100000     data analyst
2  3  49         tanya   20   10000  sales executive
3  4   8         tushi   18   20000        accounted

In [10]:
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]} ,index=['A','B','C','D'])
ds2 = pd.DataFrame({'c':[1,2,3,4],'d':[6,5,49,8]})
ds1.join(ds2)

   c   d          Name  age  salary             work
0  1   6          yash   21  101000     data science
1  2   5  yash vardhan   23  100000     data analyst
2  3  49         tanya   20   10000  sales executive
3  4   8         tushi   18   20000        accounted

In [22]:
# index name is also same other wise they showing nan value 
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]} ,index=['A','B','C','D'])
ds2 = pd.DataFrame({'c':[1,2], 'd' :[6,5]},index=['A','B'])
ds1.join(ds2)

   c  d Name  age  salary work
A  1  6  NaN  NaN     NaN  NaN
B  2  5  NaN  NaN     NaN  NaN

In [30]:
# lsuffix  ='name' change the left column name  
# rsuffix = 'name' change the right column name 
ds1 = pd.DataFrame({'a':[1,2,3,4],'b':[6,5,49,8]})
ds2 = pd.DataFrame({'b':[1,2], 'd' :[6,5]})
ds1.join(ds2,rsuffix='mc',lsuffix='bc')

   a  bbc  bmc    d
0  1    6  1.0  6.0
1  2    5  2.0  5.0
2  3   49  NaN  NaN
3  4    8  NaN  NaN